<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;
use Illuminate\Support\Facades\DB;

return new class extends Migration
{
    /**
     * Run the migrations.
     */
    public function up(): void
    {
        Schema::create('cities', function(Blueprint $table) {
            $table->id();
            $table->string('name');
        });

        $dats = [];

        foreach ( $this->getCities() as $city) {
            $data[] = [
                'name'  => $city,
            ];
        }

        DB::table('cities')->insert($data);
    }

    /**
     * Reverse the migrations.
     */
    public function down(): void
    {
        Schema::dropIfExists('cities');
    }

    private function getCities(): array
    {
        return [
            "Абакан",
            "Адлер",
            "Анапа",
            "Ангарск",
            "Архангельск",
            "Астрахань",
            "Барнаул",
            "Белгород",
            "Белореченск",
            "Бийск",
            "Благовещенск",
            "Братск",
            "Брянск",
            "Великий Новгород",
            "Владивосток",
            "Владикавказ",
            "Владимир",
            "Волгоград",
            "Волжский",
            "Вологда",
            "Воркута",
            "Воронеж",
            "Геленджик",
            "Евпатория",
            "Екатеринбург",
            "Иваново",
            "Ижевск",
            "Иркутск",
            "Йошкар-Ола",
            "Казань",
            "Калининград",
            "Калуга",
            "Кемерово",
            "Керчь",
            "Киров",
            "Коломна",
            "Комсомольск-на-Амуре",
            "Кострома",
            "Краснодар",
            "Красноярск",
            "Курган",
            "Курск",
            "Липецк",
            "Магадан",
            "Магнитогорск",
            "Майкоп",
            "Махачкала",
            "Москва",
            "Мурманск",
            "Муром",
            "Набережные Челны",
            "Нальчик",
            "Находка",
            "Нижневартовск",
            "Нижний Новгород",
            "Нижний Тагил",
            "Новокузнецк",
            "Новороссийск",
            "Новосибирск",
            "Новый Уренгой",
            "Норильск",
            "Омск",
            "Орел",
            "Оренбург",
            "Орск",
            "Пенза",
            "Пермь",
            "Петрозаводск",
            "Петропавловск-Камчатский",
            "Псков",
            "Пятигорск",
            "Ростов-на-Дону",
            "Рязань",
            "Самара",
            "Санкт-Петербург",
            "Саранск",
            "Саратов",
            "Севастополь",
            "Симферополь",
            "Смоленск",
            "Сочи",
            "Ставрополь",
            "Старый Оскол",
            "Сургут",
            "Сыктывкар",
            "Таганрог",
            "Тамбов",
            "Тверь",
            "Тольятти",
            "Томск",
            "Тула",
            "Тюмень",
            "Улан-Удэ",
            "Ульяновск",
            "Уссурийск",
            "Уфа",
            "Ухта",
            "Феодосия",
            "Хабаровск",
            "Ханты-Мансийск",
            "Херсон",
            "Чебоксары",
            "Челябинск",
            "Череповец",
            "Чита",
            "Южно-Сахалинск",
            "Якутск",
            "Ялта",
            "Ярославль"
        ];
    }
};
